app/views/articles/_form.html.erb

            <div class="col-10">
            <%= f.collection_select(:category_ids, Category.all, :id, :name,
            {prompt:"make your selection (can be empty)"},{multiple:true,size:3,class:"form-select shadow rounded"})%>
---
SELECT "categories".* FROM "categories"