app/views/users/_user.html.erb

SELECT "users".* FROM "users"
---
<div class="container ">
<% User.all.each do |user| %>

SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 3]]
---
    <%=link_to gravatar_for(user,size:150),user_path(user),class:"card-title"%>
    <p class="card-text"><%=pluralize(user.articles.count,'article') %></p>