app/controllers/articles_controller.rb

UPDATE "articles" SET "updated_at" = ?, "description" = ? WHERE "articles"."id" = ?  [["updated_at", "2022-09-21 08:26:57.780636"], ["description", "noorabbas is testing the article"], ["id", 30]]
---
  def update
    if @article.update(article_params)

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 31]]
---
  def destroy
    if @article.destroy

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
---
  def set_article
    if ((Article.find_by_id(params[:id])))
      @article = Article.find(params[:id])