app/controllers/articles_controller.rb

  def index
    @articles = Article.paginate(page: params[:page], per_page: 5)
---
SELECT COUNT(*) FROM "articles"
SELECT "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]

  def create
    @article = Article.new(article_params)
    @article.user = current_user
    if @article.save
---
INSERT INTO "articles" ("title", "created_at", "updated_at", "description", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "faheem"], ["created_at", "2022-09-06 11:55:14.092290"], ["updated_at", "2022-09-06 11:55:14.092290"], ["description", "faheem tomboii ka article"], ["user_id", 14]]

  def update
    if @article.update(article_params)
---
UPDATE "articles" SET "updated_at" = ?, "description" = ? WHERE "articles"."id" = ?  [["updated_at", "2022-08-29 15:01:11.369206"], ["description", "be quiet let everyone fight"], ["id", 6]]