app/controllers/categories_controller.rb

DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 8]]
---
  def destroy
    if @category.destroy

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_category
    if ((Category.find_by_id(params[:id])))