app/controllers/categories_controller.rb

UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "theatre"], ["updated_at", "2022-09-09 13:18:31.577390"], ["id", 7]]
---
  def update
    if @category.update(category_params)

SELECT COUNT(*) FROM "categories"
SELECT "categories".* FROM "categories"
---
  def index
    @categories = Category.paginate(page: params[:page], per_page: 5)

SELECT COUNT(*) FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = ?  [["category_id", 7]]
SELECT "articles".* FROM "articles"
---
  def show
    @articles = @category.articles.paginate(page: params[:page], per_page:5)