app/controllers/sessions_controller.rb

  def create

    if (session[:user_id] != nil)
       render json: { message: "You are already login" }
    else
      user = User.find_by(email: params[:email].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "koko@gmail.com"], ["LIMIT", 1]]