app/controllers/users_controller.rb

  def show
    @articles = @user.articles.paginate(page: params[:page], per_page: 5)
---
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 3]]
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 3]]

  def index
    @users = User.paginate(page: params[:page], per_page: 5)
---
SELECT COUNT(*) FROM "users"
SELECT "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest", "admin") VALUES (?, ?, ?, ?, ?, ?)  [["username", "faheem"], ["email", "faheem@gmail.com"], ["created_at", "2022-09-06 13:43:04.043910"], ["updated_at", "2022-09-06 13:43:04.043910"], ["password_digest", "[FILTERED]"], ["admin", 0]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "username" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "ahmad"], ["updated_at", "2022-09-02 08:28:18.517146"], ["id", 3]]