app/controllers/users_controller.rb

  def index
    # @users = User.paginate(page: params[:page], per_page: 5)
    @users=User.all
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]

  def set_user
    # @user = User.find(params[:id])
    if ((User.find_by_id(params[:id])))
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]