app/views/categories/index.html.erb

SELECT COUNT(*) FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = ?  [["category_id", 6]]
---
        <div class="card-body">
          <p class="card-text mt-1"><%= pluralize(category.articles.count, "article") %></p>